In [66]:
# Import Libraries
import pandas as pd
from pathlib import Path
%matplotlib inline

In [5]:
# Check the current directory where the Python program is executing from
print(f"Current Working Directory: {Path.cwd()}")

Current Working Directory: /Users/wilsonquizhpi/Homework-unite-4

In [67]:
# Read CSV
sp500_history_path = Path('sp500_history.csv')
algo_returns_path = Path('algo_returns.csv')
whale_retuns_path = Path('whale_returns.csv')

In [68]:
sp500_history_df = pd.read_csv(sp500_history_path, index_col="Date")
sp500_history_df.head()

              Close
Date
23-Apr-19  $2933.68
22-Apr-19  $2907.97
18-Apr-19  $2905.03
17-Apr-19  $2900.45
16-Apr-19  $2907.06

In [97]:
sp500_history_df.rename(columns={'Close': 'S&P 500'}, inplace=True)
sp500_history_df.head()

          S&P 500
Date
02/01/13  1513.17
02/01/16  1939.38
02/01/17  2279.55
02/01/18  2821.98
02/01/19  2706.53

In [99]:
sp500_history_df['S&P 500'] = sp500_history_df['S&P 500'].astype('float')
sp500_history_df.head()

          S&P 500
Date
02/01/13  1513.17
02/01/16  1939.38
02/01/17  2279.55
02/01/18  2821.98
02/01/19  2706.53

In [100]:
from datetime import datetime
sp500_history_df.index = pd.to_datetime(sp500_history_df.index)
sp500_history_df.index = sp500_history_df.index.strftime('%y/%m/%d')
sp500_history_df.head()

          S&P 500
Date
13/02/01  1513.17
16/02/01  1939.38
17/02/01  2279.55
18/02/01  2821.98
19/02/01  2706.53

In [101]:
algo_returns_df = pd.read_csv(algo_returns_path, index_col="Date")
algo_returns_df.head()

              Algo 1  Algo 2
Date
2014-05-28  0.001745     NaN
2014-05-29  0.003978     NaN
2014-05-30  0.004464     NaN
2014-06-02  0.005692     NaN
2014-06-03  0.005292     NaN

In [102]:
from datetime import datetime
algo_returns_df.index = pd.to_datetime(algo_returns_df.index)
algo_returns_df.index = algo_returns_df.index.strftime('%y/%m/%d')
algo_returns_df.head()

            Algo 1  Algo 2
Date
14/05/28  0.001745     NaN
14/05/29  0.003978     NaN
14/05/30  0.004464     NaN
14/06/02  0.005692     NaN
14/06/03  0.005292     NaN

In [103]:
sp500_history_return = sp500_history_df.pct_change()
sp500_history_return.head()

           S&P 500
Date
13/02/01       NaN
16/02/01  0.281667
17/02/01  0.175401
18/02/01  0.237955
19/02/01 -0.040911

In [116]:
whale_retuns_df = pd.read_csv(whale_retuns_path, index_col="Date")
whale_retuns_df.head()

,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
Date,,,,
2015-03-02,NaN,NaN,NaN,NaN
2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2015-03-04,0.002230,0.003241,-0.002534,0.004213
2015-03-05,0.004016,0.004076,0.002355,0.006726
2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098

In [117]:
from datetime import datetime
whale_retuns_df.index = pd.to_datetime(whale_retuns_df.index)
whale_retuns_df.index = whale_retuns_df.index.strftime('%y/%m/%d')
whale_retuns_df.head()

,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
Date,,,,
15/03/02,NaN,NaN,NaN,NaN
15/03/03,-0.001266,-0.004981,-0.000496,-0.006569
15/03/04,0.002230,0.003241,-0.002534,0.004213
15/03/05,0.004016,0.004076,0.002355,0.006726
15/03/06,-0.007905,-0.003574,-0.008481,-0.013098

In [106]:
# Check for nulls
sp500_history_df.isnull().sum
#Drop missing values
sp500_history_df = sp500_history_df.dropna()

In [107]:
# Check for nulls
algo_returns_df.isnull().sum
#Drop missing values
algo_returns_df = algo_returns_df.dropna()

In [108]:
# Check for nulls
whale_retuns_df.isnull().sum
#Drop missing values
whale_retuns_df = whale_retuns_df.dropna()

In [109]:
algo_returns_daily_return = algo_returns_df.pct_change()
algo_returns_daily_return.head()

            Algo 1    Algo 2
Date
14/06/05       NaN       NaN
14/06/06 -0.542965 -0.376459
14/06/09 -3.699288 -0.315757
14/06/10 -1.879164 -1.129760
14/06/11  0.080354  4.113963

In [110]:
whale_retuns_daily_return = whale_retuns_df.pct_change()
whale_retuns_daily_return.head()

,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
Date,,,,
15/03/03,NaN,NaN,NaN,NaN
15/03/04,-2.762070,-1.650792,4.113646,-1.641381
15/03/05,0.800968,0.257544,-1.929234,0.596558
15/03/06,-2.968465,-1.876837,-4.601872,-2.947282
15/03/09,-1.073656,-2.182252,-1.688907,-0.873840

In [111]:
# Join sp500_history_return, whale_retuns_df, and algo_returns_df full datasets by axis
joined_data_rows = pd.concat([whale_retuns_df, algo_returns_df, sp500_history_return], axis="columns", join="inner")
joined_data_rows

,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC,Algo 1,Algo 2,S&P 500
Date,,,,,,,
15/03/03,-0.001266,-0.004981,-0.000496,-0.006569,-0.001942,-0.000949,0.141976
15/03/04,0.002230,0.003241,-0.002534,0.004213,-0.008589,0.002416,0.119867
15/03/05,0.004016,0.004076,0.002355,0.006726,-0.000955,0.004323,0.121266
15/03/06,-0.007905,-0.003574,-0.008481,-0.013098,-0.004957,-0.011460,0.103477
15/03/09,0.000582,0.004225,0.005843,-0.001652,-0.005447,0.001303,-0.206188
...,...,...,...,...,...,...,...
19/04/16,0.002699,0.000388,-0.000831,0.000837,-0.006945,0.002899,0.085599
19/04/17,-0.002897,-0.006467,-0.004409,0.003222,-0.010301,-0.005228,0.071704
19/04/18,0.001448,0.001222,0.000582,0.001916,-0.000588,-0.001229,0.072505
19/04/22,-0.002586,-0.007333,-0.003640,-0.001088,0.000677,-0.001936,0.390322
19/04/23,0.007167,0.003485,0.006472,0.013278,0.004969,0.009622,0.098637